{"entityType":2,"citedByExpression":"RId=2005146008","relatedPaperExpression":"Or(Id=1799092649,Id=2372318670,Id=194149580,Id=2013338755,Id=2155709873,Id=2187177590,Id=1560483479,Id=261461018,Id=2158680676,Id=47248530,Id=1917768958,Id=2025218721,Id=2050168275,Id=2415409934,Id=2377307422,Id=291015659,Id=2785187704,Id=1769777345,Id=2218107642,Id=2018697385,Id=1799092649,Id=2372318670,Id=194149580,Id=2013338755,Id=2155709873,Id=2187177590,Id=1560483479,Id=261461018,Id=2158680676,Id=47248530,Id=1917768958,Id=2025218721,Id=2050168275,Id=2415409934,Id=2377307422,Id=291015659,Id=2785187704,Id=1769777345,Id=2218107642,Id=2018697385,Id=1799092649,Id=2372318670,Id=194149580,Id=2013338755,Id=2155709873,Id=2187177590,Id=1560483479,Id=261461018,Id=2158680676,Id=47248530,Id=1917768958,Id=2025218721,Id=2050168275,Id=2415409934,Id=2377307422,Id=291015659,Id=2785187704,Id=1769777345,Id=2218107642,Id=2018697385,Id=1799092649,Id=2372318670,Id=194149580,Id=2013338755,Id=2155709873,Id=2187177590,Id=1560483479,Id=261461018,Id=2158680676,Id=47248530,Id=1917768958,Id=2025218721,Id=2050168275,Id=2415409934,Id=2377307422,Id=291015659,Id=2785187704,Id=1769777345,Id=2218107642,Id=2018697385)","entityExpression":"Id=2005146008","entity":{"fieldsOfStudy":[{"authorCount":0,"id":142323842,"displayName":"Weighted network","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0},{"authorCount":0,"id":86256295,"displayName":"Social network","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":1.0,"entityType":0},{"authorCount":0,"id":62520636,"displayName":"Quantum mechanics","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":2.0,"entityType":0},{"authorCount":0,"id":11804174,"displayName":"Network theory","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":3.0,"entityType":0},{"authorCount":0,"id":137753397,"displayName":"Network science","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":4.0,"entityType":0},{"authorCount":0,"id":123757187,"displayName":"Network dynamics","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":5.0,"entityType":0},{"authorCount":0,"id":41008148,"displayName":"Computer science","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":6.0,"entityType":0},{"authorCount":0,"id":47822265,"displayName":"Complex system","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":7.0,"entityType":0},{"authorCount":0,"id":125748,"displayName":"Complex system","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":8.0,"entityType":0},{"authorCount":0,"id":34947359,"displayName":"Complex network","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":9.0,"entityType":0},{"authorCount":0,"id":154945302,"displayName":"Artificial intelligence","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":10.0,"entityType":0}],"venueInfo":{"id":148121101,"entityType":3,"displayName":"New Journal of Physics","volume":"9","issue":"6","firstPage":"","lastPage":"","publishedDate":"2007-06-28T00:00:00Z","doi":"10.1088/1367-2630/9/6/E02"},"sources":[{"sourceType":1,"link":"http://iopscience.iop.org/article/10.1088/1367-2630/9/6/E02/meta"},{"sourceType":0,"link":"http://iopscience.iop.org/1367-2630/9/6/E02"}],"authors":[{"currentInstitution":{"authorCount":0,"latitude":0.0,"longitude":0.0,"id":0,"description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0},"institutions":[{"authorCount":0,"latitude":0.0,"longitude":0.0,"id":0,"description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0}],"coAuthorCount":0,"hIndex":0.0,"id":630663198,"displayName":"Shlomo Havlin","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0},{"currentInstitution":{"authorCount":0,"latitude":0.0,"longitude":0.0,"id":0,"description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0},"institutions":[{"authorCount":0,"latitude":0.0,"longitude":0.0,"id":0,"description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0}],"coAuthorCount":0,"hIndex":0.0,"id":135049861,"displayName":"Maziar Nekovee","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0},{"currentInstitution":{"authorCount":0,"latitude":0.0,"longitude":0.0,"id":0,"description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0},"institutions":[{"authorCount":0,"latitude":0.0,"longitude":0.0,"id":0,"description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0}],"coAuthorCount":0,"hIndex":0.0,"id":2157086078,"displayName":"Yamir Moreno","description":"","publicationCount":0,"publicationCountByYear":[],"citationCnt":0,"citationCountByYear":[],"rank":0.0,"entityType":0}],"totalAuthorCount":3,"referenceCount":0,"references":[],"relatedPapers":[1799092649,2372318670,194149580,2013338755,2155709873,2187177590,1560483479,261461018,2158680676,47248530,1917768958,2025218721,2050168275,2415409934,2377307422,291015659,2785187704,1769777345,2218107642,2018697385,1799092649,2372318670,194149580,2013338755,2155709873,2187177590,1560483479,261461018,2158680676,47248530,1917768958,2025218721,2050168275,2415409934,2377307422,291015659,2785187704,1769777345,2218107642,2018697385,1799092649,2372318670,194149580,2013338755,2155709873,2187177590,1560483479,261461018,2158680676,47248530,1917768958,2025218721,2050168275,2415409934,2377307422,291015659,2785187704,1769777345,2218107642,2018697385,1799092649,2372318670,194149580,2013338755,2155709873,2187177590,1560483479,261461018,2158680676,47248530,1917768958,2025218721,2050168275,2415409934,2377307422,291015659,2785187704,1769777345,2218107642,2018697385],"publicationType":"1","paperResources":[],"id":2005146008,"displayName":"Focus on Complex Networked Systems: Theory and Application","description":"Complex networks are becoming manifest in many fields of contemporary science, including mathematics, physics, computer science, biology, engineering, social sciences and economics. As part of a broad movement towards research in complex systems, scientists have recently found a striking degree of self-organization that emerges in networks representing seemingly diverse complex systems (Barabasi A L 2005 Nat. Phys. 1 68). The research subject of complex networks comprises the study of how networks emerge and evolve, what is their topology, how robust they are, what new phenomena emerge as a result of the interplay between the structure and dynamics and how can we take advantage of this knowledge for applications in a wide range of natural and man-made systems. The challenge is to understand and accurately model the structure of complex networks to get more insight and a better understanding of their complex topology and functional behavior, since both are intimately linked. This makes the network approach particularly suitable to explore important aspects of complexity. The last decade has witnessed a burst of research activity in the study of large systems made of many non-identical entities, whose interaction or interconnection patterns show complex network-like structures. The research community has benefited from the massive and comparative analysis of networks from different fields, which has produced a series of unexpected results and has shown that previous models proposed in mathematical graph theory are very far from reality (see e.g., Newman M E J 2003 SIAM Rev. 45 167, Boccaletti S et al 2006 Phys. Rep. 424 175). Broadly speaking, research on such complex networks has found its focus in several directions. The first direction of research deals with the structure of networks and consists of identifying the unifying principles and statistical properties that are common to most real networks and how these can be captured via network generation models and algorithms. Another important body of work deals with spreading and percolation-like processes in complex networks, addressing a variety of phenomena ranging from disease spreading to information flow and resilience to random failures and attacks. A third and promising branch of research has arisen in the last few years spurred by the new insights gained through network modeling. It has to do with the study of the behavior of large assemblies of dynamical and nonlinear systems interacting via complex topologies. Phenomena such as synchronization, the emergence of cooperation in social and biological systems, as well as signaling and gene regulatory dynamics and other biochemical processes are now being tackled with a fresh viewpoint by considering both sources of entangled complexity: the structure and the dynamics of the system's constituents. Finally, due to adaptive and dynamical wiring, networks are also dynamical entities, whose topologies evolve and adapt in time. This is another field of research which is just emerging with promising applications to a number of areas including wireless communication systems and brain dynamics. Though modern network theory has produced a number of relevant results in the last few years, it is still at an early stage, particularly when it comes to applications in real systems and to the comprehension of the relation between their structure and function (dynamics). The subject of complex networks is highly interdisciplinary and physicists are making important contributions to the theory, with applications to areas as diverse as computer science, mathematical epidemiology, social and biological sciences, etc. This spirit is reflected in the present issue, which has collected contributions from scientists at the very forefront of the theory and applications of complex networks. The articles that make up this Focus Issue are only examples of the wide range of topics that are explored using the tools developed during the last few years. Although important progress has been made during the last decade, our understanding of complex networked systems, their structure and dynamics, is still far from well-established. We hope that this Focus Issue will further contribute towards better understanding of complex systems. The articles below represent the first contributions and further additions will appear. Focus on Complex Networked Systems: Theory and Applications Contents Beyond centrality—classifying topological significance using backup efficiency and alternative paths Yuval Shavitt and Yaron Singer Scatter networks: a new approach for analysing information scatter Lada A Adamic, K Suresh and Xiaolin Shi New approaches to model and study social networks P G Lind and H J Herrmann Search in spatial scale-free networks H P Thadakamalla, R Albert and S R T Kumara Worm epidemics in wireless ad hoc networks Maziar Nekovee A measure of centrality based on network efficiency V Latora and M Marchiori Dynamical and spectral properties of complex networks Juan A Almendral and Albert Diaz-Guilera Directed network modules Gergely Palla, Illes J Farkas, Peter Pollner, Imre Derenyi and Tamas Vicsek Topology control with IPD network creation games Jan C Scholz and Martin O W Greiner Robustness of cooperation in the evolutionary prisoner's dilemma on complex networks J Poncela, J Gomez-Gardenes, L M Floria and Y Moreno The interplay of universities and industry through the FP5 network Juan A Almendral, J G Oliveira, L Lopez, Miguel A F Sanjuan and J F F Mendes Bounding network spectra for network design Adilson E Motter Accelerating networks David M D Smith, Jukka-Pekka Onnela and Neil F Johnson Weighted network modules Illes Farkas, Daniel Abel, Gergely Palla and Tamas Vicsek Analysis of a large-scale weighted network of one-to-one human communication Jukka-Pekka Onnela, Jari Saramaki, Jorkki Hyvonen, Gabor Szabo, M Argollo de Menezes, Kimmo Kaski, Albert-Laszlo Barabasi and Janos Kertesz Structure–function relationship in complex brain networks expressed by hierarchical synchronization Changsong Zhou, Lucia Zemanova, Gorka Zamora-Lopez, Claus C Hilgetag and Jurgen Kurths Fractality and self-similarity in scale-free networks J S Kim, K-I Goh, B Kahng and D Kim Size reduction of complex networks preserving modularity A Arenas, J Duch, A Fernandez and S Gomez Fractal and transfractal recursive scale-free nets Hernan D Rozenfeld, Shlomo Havlin and Daniel ben-Avraham Building catastrophes: networks designed to fail by avalanche-like breakdown M Woolf, Z Huang and R J Mondragon Structural constraints in complex networks S Zhou and R J Mondragon The complex network of musical tastes Javier M Buldu, P Cano, M Koppenberger, Juan A Almendral and S Boccaletti Shlomo Havlin, Bar-Ilan University, Ramat-Gan, Israel Maziar Nekovee, BT Research, Martlesham, Suffolk, UK and Centre for Computational Science, University College London, UK Yamir Moreno, Institute BIFI, University of Zaragoza, Spain","publicationCount":0,"publicationCountByYear":[],"citationCnt":2,"citationCountByYear":[],"rank":21491.0,"entityType":0},"dataVersion":"2019-01-11-prod"}